{"modelTopology": {"node": [{"name": "Variable_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2304"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1728"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_2", "op": "Reshape", "input": ["Placeholder", "Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["Reshape_2", "Variable_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "BiasAdd", "op": "BiasAdd", "input": ["Conv2D", "Variable_2"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool", "op": "MaxPool", "input": ["Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "LRN", "op": "LRN", "input": ["MaxPool"], "attr": {"depth_radius": {"i": "4"}, "bias": {"f": 1.0}, "T": {"type": "DT_FLOAT"}, "beta": {"f": 0.75}, "alpha": {"f": 0.00011111111234640703}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["LRN", "Variable_3"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "BiasAdd_1", "op": "BiasAdd", "input": ["Conv2D_1", "Variable_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Relu_1", "op": "Relu", "input": ["BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "LRN_1", "op": "LRN", "input": ["Relu_1"], "attr": {"bias": {"f": 1.0}, "beta": {"f": 0.75}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.0011111111380159855}, "depth_radius": {"i": "4"}}}, {"name": "MaxPool_1", "op": "MaxPool", "input": ["LRN_1"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Reshape_3", "op": "Reshape", "input": ["MaxPool_1", "Reshape_3/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Reshape_3", "Variable_5"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add", "op": "Add", "input": ["MatMul", "Variable_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_2", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Shape", "op": "Shape", "input": ["Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout/truediv", "op": "Mul", "input": ["ConstantFolding/dropout/truediv_recip", "Relu_2"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}}}, {"name": "dropout/add", "op": "Add", "input": ["dropout/sub", "dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Floor", "op": "Floor", "input": ["dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/mul", "op": "Mul", "input": ["dropout/truediv", "dropout/Floor"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["dropout/mul", "Variable_7"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "Add", "input": ["MatMul_1", "Variable_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_3", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_2", "op": "MatMul", "input": ["Relu_3", "Variable_9"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Add_2", "op": "Add", "input": ["MatMul_2", "Variable_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model", "op": "Softmax", "input": ["Add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "Variable_10", "shape": [10], "dtype": "float32"}, {"name": "Variable_9", "shape": [192, 10], "dtype": "float32"}, {"name": "Variable_8", "shape": [192], "dtype": "float32"}, {"name": "Variable_7", "shape": [384, 192], "dtype": "float32"}, {"name": "Variable_6", "shape": [384], "dtype": "float32"}, {"name": "Variable_5", "shape": [2304, 384], "dtype": "float32"}, {"name": "Reshape_3/shape", "shape": [2], "dtype": "int32"}, {"name": "Variable_4", "shape": [64], "dtype": "float32"}, {"name": "Variable_3", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "Variable_2", "shape": [64], "dtype": "float32"}, {"name": "Variable_1", "shape": [5, 5, 3, 64], "dtype": "float32"}, {"name": "Reshape_2/shape", "shape": [4], "dtype": "int32"}, {"name": "dropout/sub", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/dropout/truediv_recip", "shape": [], "dtype": "float32"}]}]}